// eslint-disable-next-line @typescript-eslint/no-unused-vars
const names = [
  {
    'id': 1,
    'name': 'ВНС(т/сут)'
  },
  {
    'id': 2,
    'name': 'ЗБС(т/сут)'
  },
  {
    'id': 3,
    'name': 'Возврат(т/сут)'
  },
  {
    'id': 14,
    'name': 'Итого по основным ГТМ(т/сут)',
    'total': true
  },
  {
    'id': 15,
    'name': 'Накопленная по основным ГТМ(т/сут)',
    'total': true
  },
  {
    'id': 16,
    'name': 'Оптимизация(т/сут)'
  },
  {
    'id': 4,
    'name': 'С переходящим фондом'
  },
  {
    'id': 17,
    'name': 'Ввод из БД (без инвест)(т/сут)'
  },
  {
    'id': 18,
    'name': 'Прирост от мероприятий на БФ(т/сут)'
  },
  {
    'id': 20,
    'name': 'Сокращение потенциала простоя(т/сут)'
  },
  {
    'id': 21,
    'name': 'Изменение базовой добычи(т/сут)',
    'total': true
  },
  {
    'id': 22,
    'name': 'Накопленный эффект по базовому дебиту(т/сут)',
    'total': true
  },
  {
    'id': 23,
    'name': 'Прочая добыча(т)',
    'total': true
  },
  {
    'id': 24,
    'name': 'Итого увеличение добычи(т)',
    'total': true
  },
  {
    'id': 25,
    'name': 'Рост потенциала простоя(т/сут)'
  },
  {
    'id': 26,
    'name': 'Остановки по роспоряжению(т/сут)'
  },
  {
    'id': 27,
    'name': 'Остановки нерентабельного фонда(т/сут)'
  },
  {
    'id': 27,
    'name': 'Пеевод скважин в ППД(т/сут)'
  },
  {
    'id': 29,
    'name': 'Итого остановок(т/сут)',
    'total': true
  },
  {
    'id': 30,
    'name': 'Накопленная по остановкам(т/сут)',
    'total': true
  },
  {
    'id': 31,
    'name': 'Остановоный дебит ЗБС, Возвраты, Углубления(т/сут)'
  },
  {
    'id': 33,
    'name': 'Исследования(т)',
    'total': true
  },
  {
    'id': 31,
    'name': 'ОТМ УЭС(т)',
    'total': true
  },
  {
    'id': 32,
    'name': 'ОТМ УЭТ(т)',
    'total': true
  },
  {
    'id': 41,
    'name': 'ОТМ УДНГ(т)',
    'total': true
  },

  {
    'id': 34,
    'name': 'Итого по ОТМ(т)',
    'total': true
  },
  {
    'id': 47,
    'name': 'Прочие потери(т)',
    'total': true
  },
  {
    'id': 36,
    'name': 'Геологическое снижение(т/сут)',
    'total': true
  },
  {
    'id': 42,
    'name': 'Сверхнормативное снижение(т/сут)',
    'total': true
  },
  {
    'id': 37,
    'name': 'Итого потерь(т)',
    'total': true
  },
  {
    'id': 38,
    'name': 'Итого добыча(т)',
    'total': true
  },
  {
    'id': 44,
    'name': 'КЦ',
    'total': true
  },
  {
    'id': 46,
    'name': 'МЭ',
    'total': true
  },
  {
    'id': 40,
    'name': 'Потенциал простоя(т/сут)',
    'total': true
  }
]

// eslint-disable-next-line @typescript-eslint/no-unused-vars
type Places = {
  id: number;
  name: string;
  wells: Array<{
    id: number;
    name: string;
  }>
};

const places: Places[] = [
  {
    id: 0,
    name: 'ЦДНГ-1',
    wells: [
      {
        id: 0,
        name: 'Холмогорское'
      },
      {
        id: 1,
        name: 'Карамовское'
      },
      {
        id: 2,
        name: 'Пограничное'
      },
      {
        id: 3,
        name: 'Отдельное'
      },
      {
        id: 4,
        name: 'Южно-Ноябрьское'
      },
      {
        id: 5,
        name: 'Западно-Ноябрьское'
      },
      {
        id: 6,
        name: 'Спорышевское'
      }
    ]
  },
  {
    id: 1,
    name: 'ЦДНГ-2',
    wells: [
      {
        id: 0,
        name: 'Восточно-Пякутинское'
      },
      {
        id: 1,
        name: 'Крайнее'
      },
      {
        id: 2,
        name: 'Суторминское'
      },
    ]
  },
  {
    id: 2,
    name: 'ЦДНГ-3',
    wells: [
      {
        id: 0,
        name: 'Сугмутское'
      },
      {
        id: 1,
        name: 'Муравленковское'
      },
      {
        id: 2,
        name: 'Северо-Янгтинское'
      },
      {
        id: 3,
        name: 'Северо-Пямалияхское'
      },
      {
        id: 4,
        name: 'Умсейское+Южно-Пурпейское'
      },
    ]
  },
  {
    id: 3,
    name: 'ЦДНГ-7',
    wells: [
      {
        id: 0,
        name: 'Вынгапуровское'
      },
      {
        id: 1,
        name: 'Новогоднее'
      },
      {
        id: 2,
        name: 'Ярайнерское'
      }
    ]
  },
  {
    id: 4,
    name: 'ЦДНГ-01',
    wells: [
      {
        id: 0,
        name: 'Еты-Пуровское'
      },
      {
        id: 1,
        name: 'Валынтойское'
      },
      {
        id: 2,
        name: 'Вынгаяхинское'
      }
    ]
  }
]

export {places}